class МоваПрограмування:
    def __init__(self, ім'я):
        self.ім'я = ім'я  # Властивість для збереження назви мови програмування

    def вивести_привітання(self):
        print(f"Привіт! Ви використовуєте мову програмування {self.ім'я}!")


class Python(МоваПрограмування):
    def __init__(self):
        super().__init__("Python")

    def вивести_привітання(self):
        super().вивести_привітання()  # Викликаємо метод з батьківського класу
        print("Python — це мова програмування, яка акцентує на простоті і зручності використання.")

class Java(МоваПрограмування):
    def __init__(self):
        super().__init__("Java")

    def вивести_привітання(self):
        super().вивести_привітання()
        print("Java — це об'єктно-орієнтована мова програмування, відома своєю надійністю та портативністю.")

class Cpp(МоваПрограмування):
    def __init__(self):
        super().__init__("C++")

    def вивести_привітання(self):
        super().вивести_привітання()
        print("C++ — потужна мова програмування для системного та прикладного програмування.")

# Приклад використання:

python = Python()
python.вивести_привітання()

java = Java()
java.вивести_привітання()

cpp = Cpp()
cpp.вивести_привітання()
